Repository: jareksedy/Geezmo
Catalog: Geezmo/Resources/*.lproj/Localizable.strings
Languages: kk, ru

source: Apps
kk: Қосымшалар
ru: Приложения телевизора

source: Preferences
kk: Баптаулар
ru: Настройки

# #aboutApp
source: About Geezmo
kk: Geezmo туралы
ru: О Geezmo

# #faq
source: Frequently asked questions
kk: Жиі қойылатын сұрақтар
ru: Часто задаваемые вопросы

# #rateUs
source: Rate us on App Store
kk: App Store-да бізге баға беріңіз
ru: Оцените нас в App Store

source: Connect TV
kk: Теледидарды қосу
ru: Подключить телевизор

# #manuallyEnterIP
source: Manually input IP address
kk: IP мекенжайын қолмен енгізу
ru: Ввести IP-адрес вручную

source: Reset connection data
kk: Қосылымды қалпына келтіру
ru: Сбросить подключение

source: Alternative layout
kk: Балама көрініс
ru: Альтернативный вид

source: Haptic feedback
kk: Тактильді жауап
ru: Тактильный отклик

# #pairingTitle
source: Pairing code
kk: Қосылу коды
ru: Код сопряжения

source: App
kk: Қосымша
ru: Приложение

source: Connection
kk: Қосылу
ru: Подключение

source: Layout and haptics
kk: Көрініс және тактильді жауап
ru: Внешний вид и тактильный отклик

# #appInfo
source: LG Smart TV Remote Control App
kk: LG қашықтан басқару қосымшасы
ru: Пульт для телевизоров LG Smart TV

# #authorInfo
source: by Yaroslav Sedyshev
kk: Авторы — Ярослав Седышев
ru: Автор — Ярослав Седышев

source: Made with
kk: -пен жасалған
ru: Сделано с

# #madeIn
source: in Kazakhstan
kk: Қазақстанда
ru: в Казахстане

# #loadingApps
source: Please wait while we load your TV app list
kk: Теледидарыңыздағы қосымшалар тізімін жүктеп жатқанда күтіңіз
ru: Пожалуйста, подождите, пока мы загружаем список приложений на вашем ТВ

# #noAppsFound
source: Something went wrong while loading your TV app list. Please Reload.
kk: Теледидар қосымшалары тізімін жүктеу кезінде қате кетті. Қайта жүктеңіз.
ru: Произошла ошибка при загрузке списка приложений. Пожалуйста, перезагрузите.

# #reload
source: Reload app list
kk: Қайта жүктеу
ru: Перезагрузить

source: Discovered devices
kk: Табылған құрылғылар
ru: Обнаруженные устройства

# #importantNote
source: TV must be on and connected to the same network
kk: Теледидар қосылып, сол желіге қосылуы керек
ru: Телевизор должен быть включен и подключен к той же Wi-Fi сети

# #notFound
source: No TV was discovered. Please rescan your network.
kk: Ешбір теледидар табылмады. Желіге қайта сканер жасаңыз.
ru: Не обнаружено ни одного телевизора. Пожалуйста, повторно просканируйте сеть.

# #rescan
source: Rescan network
kk: Желіні қайта сканерлеу
ru: Повторное сканирование

# #inputIPMessage
source: IP address of your TV
kk: Теледидарыңыздың IP мекенжайы
ru: IP-адрес вашего ТВ

# #inputIPPrompt
source: IP address
kk: IP мекенжайы
ru: IP-адрес

# #prompted
source: Please accept the registration prompt on the TV
kk: Теледидарда тіркеу сұрауын растаңыз
ru: Пожалуйста, подтвердите запрос на регистрацию на ТВ

# #connectedAndRegistered
source: Successfully connected and registered with the TV
kk: Теледидарға сәтті қосылып, тіркелді
ru: Успешное подключение и регистрация с ТВ

# #disconnected
source: Disconnected, tap any button to reconnect
kk: Ажыратылды, қайта қосылу үшін кез келген түймені басыңыз
ru: Отключено, нажмите любую кнопку для переподключения

# #tvTurnedOn
source: TV has been successfully powered on and is ready to use
kk: Теледидар сәтті қосылып, пайдалануға дайын
ru: Телевизор успешно включен и готов к использованию

# #tvGoingOff
source: TV is going off, tap the power button to turn it back on
kk: Теледидар өшіп жатыр, оны қайта қосу үшін қуат түймесін басыңыз
ru: Телевизор выключается, нажмите кнопку питания, чтобы включить его снова

# #q1
source: Does it come with a companion Apple Watch app?
kk: Geezmo-ның Apple Watch-ке арналған қосымшасы бар ма?
ru: Поставляется ли Geezmo с приложением для Apple Watch?

# #a1
source: Yes, Geezmo comes with a fantastic companion app specifically designed for the Apple Watch. Check it out!
kk: Иә, Geezmo Apple Watch үшін арнайы жасалған керемет серіктес қосымшамен қамтамасыздалған. Танысып көріңіз!
ru: Да, Geezmo идет в комплекте с отличным приложением-компаньоном, специально разработанным для Apple Watch. Рекомендуем ознакомиться с ним!

# #q2
source: Can I customize the button layout?
kk: Түйме орналасуын баптай аламын ба?
ru: Можно ли настроить внешний вид и расположение кнопок?

# #a2
source: Currently, customization options are somewhat limited. Geezmo offers a basic layout and an alternative layout, which you can switch between in the settings menu.
kk: Қазіргі уақытта баптау мүмкіндіктері шектеулі. Geezmo негізгі орналасу және балама орналасуды ұсынады, оларды баптаулар мәзірінде ауыстыруға болады.
ru: В настоящее время возможности настройки ограничены. Geezmo предлагает базовый внешний вид и альтернативный внешний вид, между которыми вы можете переключаться в меню настроек.

# #q3
source: Can I hold a button for a continuous action?
kk: Түймені ұстап тұрып, үздіксіз әрекетті орындауға бола ма?
ru: Можно ли нажать и удерживать кнопку для непрерывного действия?

# #a3
source: Yes, certain button types such as volume controls and arrow keys support continuous actions when held down.
kk: Иә, дыбыс деңгейін басқару және бағыт көрсеткіштері сияқты кейбір түймелерді ұстап тұрғанда үздіксіз әрекеттер орындалады.
ru: Да, некоторые типы кнопок, такие как элементы управления громкостью и кнопки-стрелки, поддерживают непрерывные действия при удержании.

# #q4
source: How do I troubleshoot connection issues?
kk: Қосылу мәселелерін қалай шешемін?
ru: Устранение проблем с подключением

# #a4
source: Ensure that both your iPhone and your TV are connected to the same Wi-Fi network and that you have granted local network permissions to Geezmo. This is essential for the app to function properly. Please also ensure that your TV has the latest software installed to guarantee the best experience.
kk: iPhone мен теледидарыңыздың бір Wi-Fi желісіне қосылғанына және Geezmo үшін жергілікті желіге рұқсат берілгеніне көз жеткізіңіз. Бұл қосымшаның дұрыс жұмыс істеуі үшін өте маңызды. Сондай-ақ, теледидарыңыздың ең соңғы бағдарламалық жасақтамасы орнатылғанына көз жеткізіңіз.
ru: Убедитесь, что и ваш iPhone, и ваш телевизор подключены к одной и той же Wi-Fi сети, а также, убедитесь что вы предоставили разрешение на доступ к локальной сети для Geezmo. Это необходимо для правильной работы приложения. Убедитесь, что на вашем телевизоре установлено последнее обновление программного обеспечения для наилучшего пользовательского опыта.

# #q5
source: Does Geezmo support voice commands?
kk: Geezmo дауыс командаларын қолдай ма?
ru: Поддерживает ли Geezmo голосовые команды?

# #a5
source: No, currently Geezmo does not support voice commands.
kk: Жоқ, Geezmo қазіргі уақытта дауыс командаларын қолдамайды.
ru: Нет, в настоящее время Geezmo не поддерживает голосовые команды.

# #q6
source: Can I use Geezmo with multiple TVs?
kk: Geezmo-ны бірнеше теледидармен пайдалана аламын ба?
ru: Можно ли использовать Geezmo с несколькими телевизорами?

# #a6
source: No, not in the current version. Connecting to a different TV will reset the previously stored connection data.
kk: Жоқ, ағымдағы нұсқада басқа теледидарға қосылу бұрын сақталған қосылу деректерін қалпына келтіреді.
ru: Нет, в текущей версии подключение к другому телевизору сбросит ранее сохраненные данные подключения.

# #q7
source: Are Samsung and other non-LG TVs supported?
kk: Samsung және басқа маркалы теледидарлар қолдау таба ма?
ru: Поддерживаются ли телевизоры других брендов?

# #a7
source: No, and there are no plans to support TVs of other brands. This app is dedicated solely to WebOS TVs, such as those made by LG.
kk: Жоқ, және басқа маркалардағы теледидарларды қолдау жоспарда жоқ. Бұл қосымша тек WebOS теледидарларына арналған, мысалы, LG.
ru: Нет, это приложение предназначено исключительно для телевизоров, работающих на базе операционной системы WebOS, таких как LG.

# #q8
source: Is Android version available?
kk: Android нұсқасы қол жетімді ме?
ru: Доступна ли версия данного приложения для Android?

# #a8
source: No, currently, Geezmo is only available for iOS devices.
kk: Жоқ, қазіргі уақытта Geezmo тек iOS құрылғылары үшін қол жетімді.
ru: Нет, в настоящее время Geezmo доступно только для устройств на iOS.

# #q9
source: Is Geezmo free and open source?
kk: Geezmo тегін және ашық кодты ма?
ru: Является ли приложение Geezmo бесплатным?

# #a9
source: Yes, Geezmo is completely free and always will be. Additionally, it is open-source. Please visit our GitHub repository at
kk: Иә, Geezmo толық тегін және әрқашан солай болады. Сонымен қатар, бұл ашық кодты бағдарлама. Біздің GitHub репозиториямызға кіріңіз
ru: Да, Geezmo является полностью бесплатным и всегда останется таковым. Кроме того, Geezmo — приложение с открытым исходным кодом. Посетите наш репозиторий на GitHub

# #q10
source: Questions? Comments?
kk: Сұрақтарыңыз бар ма? Пікірлеріңіз?
ru: Вопросы? Комментарии?

# #a10
source: For any questions regarding this app, feel free to reach out to me at
kk: Бұл қосымшаға қатысты кез келген сұрақтар бойынша маған хабарласуыңызға болады
ru: По любым вопросам, касающихся этого приложения, пожалуйста пишите мне по адресу

source: Save
kk: Сақтау
ru: Сохранить

source: Reset
kk: Қалпына келтіру
ru: Сбросить

source: Cancel
kk: Бас тарту
ru: Отмена

# #yourTextHere
source: Enter text here...
kk: Мәтінді мұнда енгізіңіз...
ru: Введите текст...

source: Error
kk: Қате
ru: Ошибка

# #multicastPermissionsDenied_title
source: Permission Denied
kk: Рұқсат берілмеді
ru: Доступ запрещен

# #multicastPermissionsDenied_message
source: Multicast networking permissions are required to discover and connect to your TV. Please enable these permissions in Settings → Privacy & Security → Local Network.
kk: Теледидарыңызды табу және оған қосылу үшін көпарналы желіге рұқсаттар қажет. Бұл рұқсаттарды Параметрлер → Құпиялылық және қауіпсіздік → Жергілікті желіде қосыңыз.
ru: Для обнаружения и подключения к вашему телевизору требуется разрешение на многоканальное сетевое подключение. Пожалуйста, включите эти разрешения в разделе Настройки → Конфиденциальность и безопасность → Локальная сеть.

# #multicastPermissionsDenied_primaryButtonTitle
source: Open Settings
kk: Параметрлерді ашу
ru: Открыть Настройки

# #resetConnectionData_title
source: Do you want to reset connection data?
kk: Қосылу деректерін қалпына келтіргіңіз келе ме?
ru: Вы желаете сбросить настройки подключения?

# #resetConnectionData_message
source: You will need to reconnect and re-register with the TV.
kk: Теледидарға қайта қосылып, тіркелуіңіз қажет.
ru: Вам понадобится заново подключиться к телевизору.
